In [1]:
import pandas as pd

In [2]:
kaggle = pd.read_csv('./target_data/kaggle_income_utf8.csv')
kaggle.head()

,id,State_Code,State_Name,State_ab,County,City,Place,Type,Primary,Zip_Code,Area_Code,ALand,AWater,Lat,Lon,Mean,Median,Stdev,sum_w
0,1011000,1,Alabama,AL,Mobile County,Chickasaw,Chickasaw city,City,place,36611,251,10894952,909156,30.771450,-88.079697,38773,30506,33101,1638.260513
1,1011010,1,Alabama,AL,Barbour County,Louisville,Clio city,City,place,36048,334,26070325,23254,31.708516,-85.611039,37725,19528,43789,258.017685
2,1011020,1,Alabama,AL,Shelby County,Columbiana,Columbiana city,City,place,35051,205,44835274,261034,33.191452,-86.615618,54606,31930,57348,926.031000
3,1011030,1,Alabama,AL,Mobile County,Satsuma,Creola city,City,place,36572,251,36878729,2374530,30.874343,-88.009442,63919,52814,47707,378.114619
4,1011040,1,Alabama,AL,Mobile County,Dauphin Island,Dauphin Island,Town,place,36528,251,16204185,413605152,30.250913,-88.171268,77948,67225,54270,282.320328

In [24]:
kaggle['Zip_Code'].sort_values()

32481      601
32519      601
32520      601
32524      602
32238      602
32522      602
32523      602
32160      602
32525      603
32331      603
32174      603
32173      603
32349      603
32172      605
32168      605
32471      606
32465      610
32180      610
32179      610
32187      612
32186      612
32181      612
32476      612
32188      614
32192      614
32488      614
32499      614
32185      614
32184      614
32183      614
         ...
529      99727
560      99737
538      99743
527      99744
539      99745
626      99746
540      99747
619      99749
565      99749
541      99749
548      99761
618      99762
554      99770
556      99774
557      99777
566      99780
604      99801
603      99801
546      99827
629      99829
602      99829
620      99833
550      99833
622      99835
555      99840
609      99901
561      99901
544      99901
621      99926
552      99950
Name: Zip_Code, Length: 32526, dtype: int64

In [3]:
features = ['Zip_Code', 'Mean', 'Median']
kag_df = kaggle[features]
kag_df.head()

   Zip_Code   Mean  Median
0     36611  38773   30506
1     36048  37725   19528
2     35051  54606   31930
3     36572  63919   52814
4     36528  77948   67225

In [4]:
kag_df.shape

(32526, 3)

In [ ]:
# #keeping only zip ocdes that start with 9
# df = kag_df[kag_df['Zip_Code'].astype(str).str.startswith('9')]

In [7]:
#pivot so we can summarize mean and median income per zip code 
pivot_kag = kag_df.pivot_table(index = 'Zip_Code')

In [8]:
pivot_kag.head()

                  Mean        Median
Zip_Code
601       22496.333333  13144.333333
602       15078.400000  11323.600000
603       26046.800000  15386.400000
605       27497.500000   9461.000000
606       19194.000000  15233.000000

In [9]:
features = ['Mean', 'Median']
p_df = pivot_kag[features]

In [10]:
p_df.reset_index(level=0, inplace=True)

In [11]:

p_df.head()

   Zip_Code          Mean        Median
0       601  22496.333333  13144.333333
1       602  15078.400000  11323.600000
2       603  26046.800000  15386.400000
3       605  27497.500000   9461.000000
4       606  19194.000000  15233.000000

# Let's read in `summarized.csv`

In [12]:
summary = pd.read_csv('./datasets/summarized.csv')
summary.head()

,Unnamed: 0,zip_code,count,latitude,longitude,Price_1,Price_2,Price_3,Price_4,Rating_1,Rating_1.5,Rating_2,Rating_2.5,Rating_3,Rating_3.5,Rating_4,Rating_4.5,Rating_5,count_businesses,city
0,0,90000,1,34.000532,-118.465586,0,1,0,0,0,0,0,0,0,0,1,0,0,1,Venice
1,1,90001,30,33.976530,-118.249230,18,12,0,0,0,0,0,0,0,6,8,13,3,30,Los Angeles
2,2,90002,4,33.948102,-118.248582,3,1,0,0,0,0,0,0,0,0,3,1,0,4,Los Angeles
3,3,90003,20,33.971906,-118.272539,16,4,0,0,0,0,0,1,1,3,7,7,1,20,Los Angeles
4,4,90004,29,34.076563,-118.310331,10,19,0,0,0,0,0,0,0,1,19,6,3,29,Los Angeles

In [14]:
zip_list = list(summary['zip_code'])

In [16]:
df = p_df.loc[p_df['Zip_Code'].isin(zip_list)]

In [17]:
len(zip_list)

2655

In [18]:
summary['zip_code'].nunique()

2655

In [19]:
df.shape

(1608, 3)

              Mean    Median
Zip_Code
901       30222.25  17887.25
906           0.00      0.00
907       67875.00  54958.00
909       36350.00  21947.50
912       30753.00  20219.00

In [25]:
df = kaggle[kaggle['Zip_Code'].astype(str).str.startswith('9')]

In [26]:
df['Zip_Code'].nunique()

1755

In [30]:
zip_list[-1]

99929

In [31]:
kaggle[kaggle['Zip_Code'] == 99929]

Empty DataFrame
Columns: [id, State_Code, State_Name, State_ab, County, City, Place, Type, Primary, Zip_Code, Area_Code, ALand, AWater, Lat, Lon, Mean, Median, Stdev, sum_w]
Index: []